app/controllers/admin/users_controller.rb

SELECT  `users`.* FROM `users` ORDER BY id desc LIMIT 10 OFFSET 0
---
  def index
    @users = User.page(params[:page] || 1).per_page(params[:per_page] || 10)
      .order("id desc")