app/controllers/books_controller.rb

SELECT  `books`.* FROM `books` WHERE `books`.`is_public` = 1 ORDER BY id desc LIMIT 10 OFFSET 0
---
  def index
    @books = Book.page(params[:page] || 1).per_page(params[:per_page] || 10).
      order("id desc").where(is_public: true).includes(:tags, :user)